In [19]:
import pandas as pd
d = {'col1':[1,2],'col2':[3,4],'col3':[5,6],'col4':[7,8]}

df = pd.DataFrame(d)
df

   col1  col2  col3  col4
0     1     3     5     7
1     2     4     6     8

In [25]:
new_df = pd.DataFrame(d['col4'],columns=['col4'])
new_df

   col4
0     7
1     8

In [27]:
df = pd.DataFrame(d,index=['primero','segundo'])
df

         col1  col2  col3  col4
primero     1     3     5     7
segundo     2     4     6     8

In [28]:
df.isnull()

          col1   col2   col3   col4
primero  False  False  False  False
segundo  False  False  False  False

In [31]:
df.std(axis = 0, skipna = True)

col1    0.707107
col2    0.707107
col3    0.707107
col4    0.707107
dtype: float64

In [34]:
stats = df.describe() 
stats

           col1      col2      col3      col4
count  2.000000  2.000000  2.000000  2.000000
mean   1.500000  3.500000  5.500000  7.500000
std    0.707107  0.707107  0.707107  0.707107
min    1.000000  3.000000  5.000000  7.000000
25%    1.250000  3.250000  5.250000  7.250000
50%    1.500000  3.500000  5.500000  7.500000
75%    1.750000  3.750000  5.750000  7.750000
max    2.000000  4.000000  6.000000  8.000000